CSI API ETABS v1
cDCompColCSAS16_19.SetPreference Method
 Sets the value of a composite column design preference item.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetPreference(
	int Item,
	double Value
)
Function SetPreference (
	Item As Integer,
	Value As Double
) As Integer
Dim instance As cDCompColCSAS16_19
Dim Item As Integer
Dim Value As Double
Dim returnValue As Integer
returnValue = instance.SetPreference(Item,
	Value)
int SetPreference(
	int Item,
	double Value
)
abstract SetPreference :
        Item : int *
        Value : float -> int
Parameters
Item
Type: System.Int32
 This is an integer between 1 and 9, inclusive, indicating the preference item considered.
Multi-response case design
Phi (Structural Steel)
Phi (Structural Steel Fracture)
Phi (Concrete)
Phi (Reinforcement)
HSS welding type
Reduce HSS thickness
Pattern live load factor
Demand/capacity ratio limit
Value
Type: System.Double
 The value of the considered preference item.
 Multi-response case design
1 - Envelopes
2 - Step-by-step
3 - Last step
4 - Envelopes -- All
5 - Step-by-step -- All
 Phi (Structural Steel)
Value > 0
 Phi (Structural Steel Fracture)
Value > 0
 Phi (Concrete)
Value > 0
 Phi (Reinforcement)
Value > 0
 HSS welding type
1 - ERW
2 - SAW
 Reduce HSS thickness
0 = No
Any other value = Yes
 Pattern live load factor
Value > 0
 Demand/capacity ratio limit
Value > 0
Return Value
Type: Int32
 Returns zero if the item is successfully set; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Value As Double
   Dim ProgDet As Boolean
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'set composite column design code
   ret = SapModel.DesignCompositeColumn.SetCode("CSA S16-19")
'set overwrite item
   ret = SapModel.DesignCompositeColumn.CSAS16_19.SetPreference(2, 1)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDCompColCSAS16_19 Interface
ETABSv1 Namespace